app/Controllers/Auth.php

    public function valid_login()
    {
        //ambil data dari form
        $data = $this->request->getPost();
        //$role = $this->request->getPost();
        //ambil data user di database yang usernamenya sama
        $user = $this->userModel->where('username', $data['username'])->first();
---
SELECT *
FROM `tb_user`
WHERE `username` = 'admin'
 LIMIT 1