app/Models/DataPasienModel.php

SELECT *
FROM `tb_pasien`
JOIN `tb_kelurahan` ON `tb_pasien`.`id_kelurahan`=`tb_kelurahan`.`id_kelurahan`
---
    public function joinpasienxkelurahan() {
        return $this->db->table('tb_pasien')
        ->join('tb_kelurahan', 'tb_pasien.id_kelurahan=tb_kelurahan.id_kelurahan')
        ->get()->getResultArray();

SELECT *
FROM `tb_kelurahan`
---
    public function dropdownkelurahan()
    {
        return $this->db->table('tb_kelurahan')->get()->getResultArray();

SELECT RIGHT(id_pasien, 5) as id_pasien
FROM `tb_pasien`
ORDER BY `id_pasien` DESC
 LIMIT 1
---
public function idPasien() {
        $kode = $this->db->table('tb_pasien')
        ->select('RIGHT(id_pasien,5) as id_pasien', false)
            ->orderBy('id_pasien', 'DESC')
            ->limit(1)->get()->getRowArray();